collected-data/gfs-4-rep-results/experiements-1-3/6-failure/tfd/fio-gfs-test-low-seq-write-tfd.txt
Started: 15-04-2022--18-12-07

low-seq-write-/mnt/gfs: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
fio: pid=13643, err=107/file:io_u.c:1846, func=io_u error, error=Transport endpoint is not connected

low-seq-write-/mnt/gfs: (groupid=0, jobs=1): err=107 (file:io_u.c:1846, func=io_u error, error=Transport endpoint is not connected): pid=13643: Fri Apr 15 18:12:18 2022
  write: IOPS=22, BW=2877KiB/s (2946kB/s)(16.9MiB/6007msec); 0 zone resets
    slat (nsec): min=33663, max=61390, avg=39384.90, stdev=3528.62
    clat (usec): min=34826, max=55621, avg=44106.29, stdev=4735.78
     lat (usec): min=34862, max=55659, avg=44147.44, stdev=4735.91
    clat percentiles (usec):
     |  1.00th=[34866],  5.00th=[34866], 10.00th=[34866], 20.00th=[35390],
     | 30.00th=[45876], 40.00th=[46400], 50.00th=[46400], 60.00th=[46400],
     | 70.00th=[46400], 80.00th=[46400], 90.00th=[46400], 95.00th=[46400],
     | 99.00th=[54264], 99.50th=[55837], 99.90th=[55837], 99.95th=[55837],
     | 99.99th=[55837]
   bw (  KiB/s): min= 2560, max= 3584, per=100.00%, avg=2880.42, stdev=290.88, samples=12
   iops        : min=   20, max=   28, avg=22.50, stdev= 2.28, samples=12
  lat (msec)   : 50=97.79%, 100=1.47%
  cpu          : usr=0.10%, sys=0.00%, ctx=273, majf=0, minf=47
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.7%, 4=99.3%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,136,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2877KiB/s (2946kB/s), 2877KiB/s-2877KiB/s (2946kB/s-2946kB/s), io=16.9MiB (17.7MB), run=6007-6007msec
low-seq-write-/mnt/gfs: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
fio: pid=15283, err=107/file:io_u.c:1846, func=io_u error, error=Transport endpoint is not connected

low-seq-write-/mnt/gfs: (groupid=0, jobs=1): err=107 (file:io_u.c:1846, func=io_u error, error=Transport endpoint is not connected): pid=15283: Fri Apr 15 18:16:34 2022
  write: IOPS=22, BW=2871KiB/s (2940kB/s)(16.9MiB/6018msec); 0 zone resets
    slat (nsec): min=33943, max=55315, avg=39130.66, stdev=3716.81
    clat (usec): min=34815, max=91839, avg=44230.13, stdev=6453.85
     lat (usec): min=34852, max=91880, avg=44271.09, stdev=6453.97
    clat percentiles (usec):
     |  1.00th=[34866],  5.00th=[34866], 10.00th=[34866], 20.00th=[35390],
     | 30.00th=[45876], 40.00th=[46400], 50.00th=[46400], 60.00th=[46400],
     | 70.00th=[46400], 80.00th=[46400], 90.00th=[46400], 95.00th=[46400],
     | 99.00th=[63177], 99.50th=[91751], 99.90th=[91751], 99.95th=[91751],
     | 99.99th=[91751]
   bw (  KiB/s): min= 2560, max= 3584, per=100.00%, avg=2880.42, stdev=346.93, samples=12
   iops        : min=   20, max=   28, avg=22.50, stdev= 2.71, samples=12
  lat (msec)   : 50=97.79%, 100=1.47%
  cpu          : usr=0.08%, sys=0.00%, ctx=272, majf=0, minf=44
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.7%, 4=99.3%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,136,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2871KiB/s (2940kB/s), 2871KiB/s-2871KiB/s (2940kB/s-2940kB/s), io=16.9MiB (17.7MB), run=6018-6018msec
low-seq-write-/mnt/gfs: (g=0): rw=write, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=1
fio-3.29-112-gc3773
Starting 1 process
fio: pid=16928, err=107/file:io_u.c:1846, func=io_u error, error=Transport endpoint is not connected

low-seq-write-/mnt/gfs: (groupid=0, jobs=1): err=107 (file:io_u.c:1846, func=io_u error, error=Transport endpoint is not connected): pid=16928: Fri Apr 15 18:20:51 2022
  write: IOPS=22, BW=2900KiB/s (2970kB/s)(18.0MiB/6355msec); 0 zone resets
    slat (nsec): min=30940, max=60832, avg=39062.99, stdev=3688.85
    clat (usec): min=34869, max=62963, avg=43548.64, stdev=5325.42
     lat (usec): min=34912, max=63004, avg=43589.53, stdev=5325.06
    clat percentiles (usec):
     |  1.00th=[34866],  5.00th=[34866], 10.00th=[34866], 20.00th=[35390],
     | 30.00th=[45876], 40.00th=[45876], 50.00th=[46400], 60.00th=[46400],
     | 70.00th=[46400], 80.00th=[46400], 90.00th=[46400], 95.00th=[46400],
     | 99.00th=[58983], 99.50th=[63177], 99.90th=[63177], 99.95th=[63177],
     | 99.99th=[63177]
   bw (  KiB/s): min= 2560, max= 3840, per=100.00%, avg=2901.75, stdev=398.20, samples=12
   iops        : min=   20, max=   30, avg=22.67, stdev= 3.11, samples=12
  lat (msec)   : 50=97.93%, 100=1.38%
  cpu          : usr=0.09%, sys=0.00%, ctx=290, majf=0, minf=45
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.7%, 4=99.3%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,145,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2900KiB/s (2970kB/s), 2900KiB/s-2900KiB/s (2970kB/s-2970kB/s), io=18.0MiB (18.9MB), run=6355-6355msec